In [2]:
import pandas as pd

data = {'Name': ['Ajay', 'Amit', 'Keerthi', 'Prem', 'Priya', 'Pragna'],
        'Stream': ['Math', 'Commerce', 'Science', 'Math', 'Math', 'Science'],
        'Percentage': [88, 92, 95, 70, 65, 78]}

# Create the data frame
df = pd.DataFrame(data)


print(df)

      Name    Stream  Percentage
0     Ajay      Math          88
1     Amit  Commerce          92
2  Keerthi   Science          95
3     Prem      Math          70
4    Priya      Math          65
5   Pragna   Science          78

In [3]:
df[df['Percentage'] > 80]

      Name    Stream  Percentage
0     Ajay      Math          88
1     Amit  Commerce          92
2  Keerthi   Science          95

In [4]:
df.loc[df['Percentage'] > 80]

      Name    Stream  Percentage
0     Ajay      Math          88
1     Amit  Commerce          92
2  Keerthi   Science          95

In [5]:
df.loc[:, ['Name', 'Percentage']]

      Name  Percentage
0     Ajay          88
1     Amit          92
2  Keerthi          95
3     Prem          70
4    Priya          65
5   Pragna          78

In [6]:
df.loc[df['Percentage'] > 80, ['Name', 'Percentage']]

      Name  Percentage
0     Ajay          88
1     Amit          92
2  Keerthi          95

In [8]:
df.loc[df['Name'] == 'Ajay', 'Percentage'] = 90
df

      Name    Stream  Percentage
0     Ajay      Math          90
1     Amit  Commerce          92
2  Keerthi   Science          95
3     Prem      Math          70
4    Priya      Math          65
5   Pragna   Science          78

In [15]:
df.loc[(df['Stream'] != 'Math')]

      Name    Stream  Percentage
1     Amit  Commerce          92
2  Keerthi   Science          95
5   Pragna   Science          78

In [18]:
df.iloc[:2,:2]

   Name    Stream
0  Ajay      Math
1  Amit  Commerce

In [19]:
df.sort_values(by='Stream', ascending=True)

      Name    Stream  Percentage
1     Amit  Commerce          92
0     Ajay      Math          90
3     Prem      Math          70
4    Priya      Math          65
2  Keerthi   Science          95
5   Pragna   Science          78

In [24]:
df.drop(df[df['Stream'] == 'Math'].index, inplace = True)

In [25]:
df

      Name    Stream  Percentage
1     Amit  Commerce          92
2  Keerthi   Science          95
5   Pragna   Science          78